docs/posts/2017-12-24-prayer-for-the-fourth-sunday-of-advent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for the Fourth Sunday of Advent</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for the Fourth Sunday of Advent</h1>
<p class="subtitle" role="doc-subtitle">Dec 24, 2017</p>
</header><p>
A prayer for Mitch Randall’s last Sunday as pastor of NorthHaven Church, before he takes his new position as executive director of the Baptist Center for Ethics.
</p>

<p>
God of peace and joy,
</p>

<p>
For centuries,<br>
Israel anticipated<br>
the coming of the Messiah;<br>
and as one expectation<br>
was fulfilled,<br>
another was born,<br>
for we still long<br>
for the day when<br>
that same Messiah<br>
will come again.
</p>

<p>
Christmas is still a day<br>
when old dreams are fulfilled,<br>
and new dreams are born.
</p>

<p>
We give thanks for what<br>
this church has become<br>
in the years that Mitch<br>
has been with us:
</p>

<p>
For those who have<br>
been rejected,<br>
it is a place to feel welcome.
</p>

<p>
For those who have<br>
felt constrained,<br>
a place to be free.
</p>

<p>
For those whose gifts<br>
have been denied,<br>
a place to serve.
</p>

<p>
And so it is fitting<br>
that at Christmas<br>
We share with the world.<br>
this gift that we have received,
</p>

<p>
And may we, through our<br>
words, actions, and gifts,<br>
declare to the world<br>
that there is still<br>
good news of glad tidings,<br>
for all people, everywhere.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
